 ////////////////////////////////////////////////////////////////////////////////
 // <Заголовок модуля: краткое описание и условия применения модуля.>
 //  
 ////////////////////////////////////////////////////////////////////////////////
 #Область ПрограммныйИнтерфейс
 
 Процедура ПринятьОтвет(Команда, Форма) Экспорт
	
	РодительКоманды = Форма.Элементы.Найти("Кнопка" + Команда.Имя).Родитель; 
	Подчиненные = РодительКоманды.ПодчиненныеЭлементы;
	ИмяОтвета = Подчиненные[1].ПодчиненныеЭлементы[0].Имя; 
	ЗначениеОтвета = Форма.ЭтотОбъект[ИмяОтвета];		
	
	ПравильныйОтвет = Число(Подчиненные[4].Заголовок);
	
	Если ЗначениеОтвета = ПравильныйОтвет Тогда
		Подчиненные[3].Заголовок = "Правильный ответ";
		//@skip-check new-color
		Подчиненные[3].ЦветТекста = Новый Цвет(23, 172, 47);			
	Иначе 	
		Подчиненные[3].Заголовок = "Неправильный ответ";   
		//@skip-check new-color
		Подчиненные[3].ЦветТекста = Новый Цвет(255, 0, 0);			
	КонецЕсли;

		
КонецПроцедуры

 #КонецОбласти
 
 #Область СлужебныеПроцедурыИФункции
 
 #КонецОбласти
 
