
&НаКлиенте
Процедура НачатьТестирование(Команда) 
	
	Если НЕ ПустаяСтрока(ПолучитьКодТестирования()) Тогда		
		ОткрытьФорму("Обработка.УчебноеТестирование.Форма.Форма",,ЭтаФорма);		
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Выберите тестирование!";
		Сообщение.Сообщить(); 	
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеОткрытияФормыВыборТестирования(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
	
	Если РезультатЗакрытия <> Неопределено Тогда 
		
		Тестирование = РезультатЗакрытия.Наименование;
		УстановитьКодТестирования(РезультатЗакрытия.Код);		
		
	КонецЕсли;	
	
КонецПроцедуры 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	
КонецПроцедуры

&НаКлиенте
Процедура ТестированиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
 	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеОткрытияФормыВыборТестирования", ЭтотОбъект );
	ОткрытьФорму("ОбщаяФорма.ФормаВыборТестирования",,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
	
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда) 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборКурсаЗавершение", ЭтотОбъект);	
	ОткрытьФорму("Справочник.Вопросы.Форма.ФормаКурса",,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
	
КонецПроцедуры 

&НаКлиенте
Процедура ВыборКурсаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Если Результат.Свойство("Код") Тогда			
			
			ПараметрыОткрытия = Новый Структура("Код", Результат.Код);
			ОписаниеОповещения = Новый ОписаниеОповещения("ВыборРазделаЗавершение", ЭтотОбъект);
			ОткрытьФорму("Справочник.Вопросы.Форма.ФормаРазделов", ПараметрыОткрытия,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры 

&НаКлиенте
Процедура ВыборРазделаЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат <> Неопределено Тогда
		
		Если Результат.Свойство("Код") Тогда
			
			УстановитьКодТестирования(Результат.Код);

		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры
 
&НаСервереБезКонтекста
Процедура УстановитьКодТестирования(КодТестирования)
	
	ПараметрыСеанса.КодТестирования = КодТестирования;	
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьКодТестирования()
	
	Возврат ПараметрыСеанса.КодТестирования;	
	
КонецФункции




 







